/* 
  Localizable.strings
  dialog

  Created by Bart Reardon on 29/5/2022.
  
  German translation by colorenz
*/

// error sheet
"One or more input fields are incorrect" = "Ein oder mehrere Eingabefelder sind fehlerhaft";
"is required" = "Ist erforderlich";
"doesn't match the required format" = "nicht dem erforderlichen Format entspricht";

// required fields text
"* Required Fields" = "*Erforderliche Felder";

//buttons
"Cancel" = "Abbrechen";
"More Information" = "Mehr Informationen";
"OK" = "OK";
"Select" = "Auswählen";

//default text
"default-title" = "";
"default-message" = "";
"Click for additional information" = "Klicken Sie für weitere Informationen";

"Confirm" = "Bestätigen";
"Downloading" = "Herunterladen";

"confirmation failed  <br>values do not match" = "Bestätigung fehlgeschlagen <br>Werte stimmen nicht überein";

//constructor kit labels
"Welcome to the swiftDialog builder"            = "Willkommen beim swiftDialog Builder";
"Select properties on the left to modify. swiftDialog will update to show the changes in realtime"        = "Wählen Sie die zu ändernden Eigenschaften auf der linken Seite aus. swiftDialog wird aktualisiert, um die Änderungen in Echtzeit anzuzeigen.";
"Basic"              = "Basic";
"Content"            = "Inhalt";
"Window"             = "Fenster";
"Sidebar"            = "Seitenleiste";
"Data Entry"          = "Dateneingabe";
"Buttons"            = "Tasten";
"Advanced"           = "Fortschrittlich";
"List Items"          = "Elemente auflisten";
"Images"             = "Bilder";
"Media"              = "Medien";
"Output"             = "Ausgabe";
"JSON Output"         = "JSON-Ausgabe";
"Quit"              = "Aufhören";
"Export Command"      = "Befehl exportieren";
"Title"              = "Titel";
"Colour"             = "Farbe";
"Reset"              = "Zurücksetzen";
"Font Size: "           = "Schriftgröße: ";
"value:"              = "Wert:";
"Message"           = "Nachricht";
"Text Alignment"      = "Textausrichtung";
"Vertical Position"   = "Vertikale Position";
"Window Height"       = "Fensterhöhe";
"Height value:"        = "Höhenwert:";
"Window Width"        = "Fensterbreite";
"Width value:"         = "Breitenwert:";
"Window Properties"   = "Fenstereigenschaften";
"Preset Sizes"        = "Voreingestellte Größen";
"Small"              = "Klein";
"Big"                = "Groß";
"Screen Background Blur"         = "Bildschirmhintergrund unscharf";
"Movable"            = "Beweglich";
"Force on Top"         = "Force on Top";
"Progress Bar"        = "Fortschrittsanzeige";
"Progress value:"      = "Fortschrittswert:";
"Progress Text:"       = "Fortschrittstext:";
"Banner Image"        = "Bannerbild";
"Select"             = "Wählen";
"Watermark"          = "Wasserzeichen";
"Fill"               = "Füllen";
"Opacity"              = "Alpha";
"Scale"              = "Skala";
"Position"           = "Position";
"Icon"               = "Symbol";
"Visible"            = "Sichtbar";
"Centred"            = "zentriert";
"Select"             = "Wählen";
"Icon Size"           = "Symbolgröße";
"Size value:"          = "Größenwert:";
"Overlay"            = "Überlagerung";
"Infobox"            = "Infobox";
"Infotext"           = "Infotext";
"Info Text"      = "Infotext";
"Button1"            = "Knopf 1";
"Button2"            = "Taste2";
"Info Button"    = "Info-Button";
"Quit on Info"         = "Beenden bei Info";
"Label: "              = "Etikette: ";
"Info Button Action: "   = "Aktion der Info-Schaltfläche: ";
"AutoPlay"           = "Automatisches Abspielen";
"Autoplay Seconds"    = "Sekunden automatisch abspielen";
"Path"               = "Weg";
"Caption"            = "Bildbeschriftung";
"Status Text"         = "Statustext";
"Status"             = "Status";
"Format output as JSON"         = "Ausgabe als JSON formatieren";
"Textfields"         = "Textfelder";
"Show"               = "Show";
"Required"           = "Erforderlich";
"Secure"             = "Sicher";
"Prompt"             = "Prompt";
"Regex"              = "Regex";
"Regex Error"         = "Regex-Fehler";
"Select"             = "Wählen";
"Checkbox"           = "Kontrollkästchen";
"Video"              = "Video";
"Filename"           = "Dateiname";
"Web"                = "Netz";
"URL"                = "URL";
"Disabled"           = "Deaktiviert";
"Enabled"            = "Ermöglicht";
